// 10.charCodeAt() ბრუნდება ASCII კოდი მოცემული ინდექსის სიმბოლოს.
const test = "dato";
const test1 = test.charCodeAt(1);
console.log(test1); // 97 (ASCII კოდი 'a')
// ASCII (American Standard Code for Information Interchange) არის კოდირების სისტემა, რომელიც გამოიყენება ტექსტის სიმბოლოების გამოსახატავად კომპიუტერში და სხვა მოწყობილობებში. იგი შეიქმნა, რათა სტანდარტული იყოს სიმბოლოების კოდირება, რაც შესაძლებელს გახდის სხვადასხვა სისტემებს შორის მონაცემების გაცვლას.

// ASCII-ს კოდი მოიცავს 128 სიმბოლოს, სადაც თითოეული სიმბოლო წარმოდგენილია უნიკალური რიცხვით 0-დან 127-მდე. ეს სიმბოლოები მოიცავს ინგლისურ ანბანს (დიდი და პატარა ასოები), ციფრებს, სასვენ ნიშნებს და კონტროლის სიმბოლოებს.

// მაგალითად:

// დიდი ასო "A" კოდირებულია როგორც 65
// პატარა ასო "a" კოდირებულია როგორც 97
// ციფრი "0" კოდირებულია როგორც 48
// ახალი ხაზის სიმბოლო (newline) კოდირებულია როგორც 10
// ASCII-ს გამოყენება საშუალებას გვაძლევს სტანდარტული ფორმატით კოდირება და დეკოდირება მოვახდინოთ ტექსტური მონაცემების.
